# Python S6 Pandas

## My Course Notes and Code

These are my notes from the Udemy course available at: 
https://www.udemy.com/course/python-for-data-science-and-machine-learning-bootcamp/

I'm focusing on the section 6 of the course, which deals with **Pandas**.

#### S6 Overview

- Series
- DataFrames
- Missing Data
- GroupBy
- Merging, Joining, Concatenating
- Pandas Operations
- Data Input and Output

_____
#### S6V25 Intro to Pandas

- Pandas is built on top of **NumPy**
- It enalbles fast analysis and data cleaning and preparation
- Python's version of **Excel**, or R **Data Frames**
- Has built-in visualization features
- Can work with data from a variety of formats

_____
#### S6V26 Series

- It's the data type we'll use to build DataFrames in the next lecture
- Similar to *NumPy arrays*   
    - However, Series have (labelled) indexes, and...
    - ... can hold a variety of object types

##### Setting various Python objects to Pandas Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']            # list
my_data = [10, 20, 30]              # list
arr = np.array(my_data)             # NumPy array
d = {'a' : 10, 'b' : 20, 'c' : 30}  # dictionary

In [3]:
pd.Series(data = my_data)           # labelled-index Series

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_data, labels) # doesn't have to be specified, it's the default order

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr)     # Works the same as with lists

0    10
1    20
2    30
dtype: int32

In [7]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(d) # Keys are automatically set as indexes, and values as data points

a    10
b    20
c    30
dtype: int64

##### Pandas Series can store a wide variety of data types...

- ... "pretty much any type of Python object" 
- Super-flexible

In [9]:
pd.Series(labels)           # e.g., strings

0    a
1    b
2    c
dtype: object

In [10]:
pd.Series(data = [sum, print, len])  # functions

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

##### "Grabbing" information from a Series

In [11]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [12]:
ser2 = pd.Series([1,2,5,4], ['USA', 'Germany', 'Italy', 'Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [13]:
ser1['USA'] # works similar as withy Python dictionaries # type label, get data

1

In [14]:
ser3 = pd.Series(labels)
ser3

0    a
1    b
2    c
dtype: object

In [15]:
ser3[0]

'a'

##### Basic operations with Series

In [16]:
ser1 + ser2 # Pandas tries to perform the operation based on the matching index

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

- 'Italy' and 'USSR' couldn't be matched -> **NaN**
- *Integers* are converted into *floats* when doing operations with Pandas Series (or prety much any NumPy- or Pandas-based object)
    - To prevent accidental information loss

_____
#### S6V27 - DataFrames pt 1

DataFrames will be our main tool in working with Pandas.

In [17]:
# import numpy as nump
# import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [18]:
df = pd.DataFrame(
    data = randn(5, 4), 
    index = ['A', 'B', 'C', 'D', 'E'],
    columns = ['W', 'X', 'Y', 'Z'])

df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Each of the columns W-Z is actually a Pandas Series. They all share the same index.

DataFrame is a group of Series sharing the same index :)

##### Indexing and Selection (selecting columns)

In [19]:
df['W']         # First way to grabb a column

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [20]:
type(df['W']) # it really is just a Series :)

pandas.core.series.Series

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
df.W # 2nd way to grab a column (SQL-like). Appears like calling methods off of df

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [23]:
df[['Y', 'Z']] # grabbing multiple columns # returns DataFrame

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

##### Creating new columns

In [24]:
df['new'] = randn(5)
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  0.302665
B  0.651118 -0.319318 -0.848077  0.605965  1.693723
C -2.018168  0.740122  0.528813 -0.589001 -1.706086
D  0.188695 -0.758872 -0.933237  0.955057 -1.159119
E  0.190794  1.978757  2.605967  0.683509 -0.134841

In [25]:
df['new2'] = df['W'] + df['X']
df

          W         X         Y         Z       new      new2
A  2.706850  0.628133  0.907969  0.503826  0.302665  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  1.693723  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.706086 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -1.159119 -0.570177
E  0.190794  1.978757  2.605967  0.683509 -0.134841  2.169552

##### Dropping columns and rows

In [26]:
df.drop('new2', axis = 'columns') # or `axis = 1` # This does not happen in place

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  0.302665
B  0.651118 -0.319318 -0.848077  0.605965  1.693723
C -2.018168  0.740122  0.528813 -0.589001 -1.706086
D  0.188695 -0.758872 -0.933237  0.955057 -1.159119
E  0.190794  1.978757  2.605967  0.683509 -0.134841

In [27]:
df

          W         X         Y         Z       new      new2
A  2.706850  0.628133  0.907969  0.503826  0.302665  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  1.693723  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.706086 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -1.159119 -0.570177
E  0.190794  1.978757  2.605967  0.683509 -0.134841  2.169552

In [28]:
df.drop(['new', 'new2'], axis = 'columns', inplace = True) # must be specified...
df                                                 # ... for many Pandas methods.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df.drop('E', axis = 0) # `axis = 0` is set by default # Not in place

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [30]:
df.shape # tuple # rows (0) and columns (1)

(5, 4)

##### Selecting rows

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df.loc['A'] # Not only columns, but rows as well are Series # loc[RowName]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [33]:
df.iloc[2] # `df.loc['C']` # iloc[RowIndexPosition]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

##### Selecting subsets of rows and columns

In [34]:
df.loc['B', 'Y'] # row, col

-0.8480769834036315

In [35]:
df.loc['B', 'W':'Y']

W    0.651118
X   -0.319318
Y   -0.848077
Name: B, dtype: float64

In [36]:
df.loc[['A', 'B'], 'X':]

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965

In [37]:
df.loc[['A', 'E'], ['W', 'Z']]

          W         Z
A  2.706850  0.503826
E  0.190794  0.683509

_____
#### S6V28 - DataFrames pt 2

##### Conditional Selection

In [38]:
# import numpy as nump
# import pandas as pd
# from numpy.random import randn
# np.random.seed(101)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [40]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [42]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

Conditional selection of this sort returns DataFrames as the result. Methods can be called off of these resulting DataFrames.

In [44]:
result = df[df['Z'] < 0] # In two steps
result['X']

C    0.740122
Name: X, dtype: float64

In [45]:
df[df['W'] > 0]['X']    # In one step

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [46]:
df[df['W'] > 0][['Y', 'X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [47]:
df['W'][df['W'] > 0]

A    2.706850
B    0.651118
D    0.188695
E    0.190794
Name: W, dtype: float64

##### Multiple Conditions for Selection

In [48]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Python's normal `and` operator won't work on Series - since it can't compare one Series of Boolean values with another. Instead, we use `&`.

In [49]:
df[(df['W'] > 0) & (df['X'] < 1)] # and

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

The same goes for `or` -> `|`

In [50]:
df[(df['W'] > 0) | (df['X'] < 1)] # or

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

##### Resetting the index/Setting it to something else

In [51]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df.reset_index() # doesn't occur in place, unless specified # `inplace = True`

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [53]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [54]:
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [55]:
df.set_index('States') # doesn't happen in place

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

_____
#### S6V29 DataFrames pt 3

##### MultiIndex (Index Hierarchy)

In [56]:
# Index Levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']          # list
inside = [1, 2, 3, 1, 2, 3]                             # list
hier_index = list(zip(outside, inside))                 # list of tuple pairs
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [57]:
df = pd.DataFrame(
        data = randn(6,2), 
        index = hier_index,
        columns = ['A', 'B'])

df

             A         B
G1 1  0.390528  0.166905
   2  0.184502  0.807706
   3  0.072960  0.638787
G2 1  0.329646 -0.497104
   2 -0.754070 -0.943406
   3  0.484752 -0.116773

In [58]:
df.loc['G1']

          A         B
1  0.390528  0.166905
2  0.184502  0.807706
3  0.072960  0.638787

In [59]:
df.loc['G1'].loc[1]

A    0.390528
B    0.166905
Name: 1, dtype: float64

In [60]:
df.index.names

FrozenList([None, None])

In [61]:
df.index.names = ['Groups', 'Num']

df

                   A         B
Groups Num
G1     1    0.390528  0.166905
       2    0.184502  0.807706
       3    0.072960  0.638787
G2     1    0.329646 -0.497104
       2   -0.754070 -0.943406
       3    0.484752 -0.116773

In [62]:
df.loc['G2'].loc[2]['B']

-0.9434064032519315

In [63]:
df.loc['G1'].loc[1]['A']

0.39052784273374097

##### Cross-Section

In [64]:
df.xs('G1')                     # cross-section

            A         B
Num
1    0.390528  0.166905
2    0.184502  0.807706
3    0.072960  0.638787

In [65]:
df.xs(1, level = 'Num')

               A         B
Groups
G1      0.390528  0.166905
G2      0.329646 -0.497104

_____
#### S6V30 Missing Data

In [66]:
d = {'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [67]:
df.dropna() # drops any rows with one or more missing values

     A    B  C
0  1.0  5.0  1

In [68]:
df.dropna(axis = 1) # columns

   C
0  1
1  2
2  3

In [69]:
df.dropna(thresh = 2) # non-NAs required in a row/column to NOT get dropped

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [70]:
df.dropna(thresh = 1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [71]:
df.dropna(thresh = 3)

     A    B  C
0  1.0  5.0  1

In [72]:
df.fillna(value = 'FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [73]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

_____
#### S6V31 groupby

- Just like SQL :)
- Grouping rows based on columns, performing aggregate operations on them

- Syntax:
    - `df.groupby('column_name').aggregate_operation()`

In [74]:
data = {'Company' : ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person' : ['Sam', 'Mark', 'Julie', 'Bertha', 'Allen', 'John'],
        'Sales' : [200, 120, 340, 124, 243, 350]}

df = pd.DataFrame(data)
df

  Company  Person  Sales
0    GOOG     Sam    200
1    GOOG    Mark    120
2    MSFT   Julie    340
3    MSFT  Bertha    124
4      FB   Allen    243
5      FB    John    350

In [75]:
df.groupby('Company')

In [76]:
df.groupby('Company').mean() # 'Person' column is ignored - non-numeric

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [77]:
df.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [78]:
df.groupby('Company').std() # These operations return DataFrames :)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [79]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [80]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [81]:
df.groupby('Company').max() # It does work with string data, but should be avoided

        Person  Sales
Company
FB        John    350
GOOG       Sam    200
MSFT     Julie    340

In [82]:
df.groupby('Company').min()

         Person  Sales
Company
FB        Allen    243
GOOG       Mark    120
MSFT     Bertha    124

In [83]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [84]:
df.groupby('Company').describe()['Sales']['mean']

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: mean, dtype: float64

In [85]:
df.groupby('Company').describe().loc['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [86]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [87]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [88]:
df.groupby('Company').describe().transpose().loc['Sales'].loc['count']

Company
FB      2.0
GOOG    2.0
MSFT    2.0
Name: count, dtype: float64

_____
#### S6V32 Merging, Joining, Concatenating

##### Creating Example DataFrames

In [89]:
df1 = pd.DataFrame({'A' : ['A0', 'A1', 'A2', 'A3'],
                    'B' : ['B0', 'B1', 'B2', 'B3'],
                    'C' : ['C0', 'C1', 'C2', 'C3'],
                    'D' : ['D0', 'D1', 'D2', 'D3']},
                    index = [0, 1, 2, 3])

In [90]:
df2 = pd.DataFrame({'A' : ['A4', 'A5', 'A6', 'A7'],
                    'B' : ['B4', 'B5', 'B6', 'B7'],
                    'C' : ['C4', 'C5', 'C6', 'C7'],
                    'D' : ['D4', 'D5', 'D6', 'D7']},
                    index = [4, 5, 6, 7])

In [91]:
df3 = pd.DataFrame({'A' : ['A8', 'A9', 'A10', 'A11'],
                    'B' : ['B8', 'B9', 'B10', 'B11'],
                    'C' : ['C8', 'C9', 'C10', 'C11'],
                    'D' : ['D8', 'D9', 'D10', 'D11']},
                    index = [8, 9, 10, 11])

In [92]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [93]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [94]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

##### Concatenation

"Glues" together DataFrames. Their dimensions need to match along the axis we sant to concatenate on.

In [95]:
pd.concat([df1, df2, df3]) # By default it concatenates on axis = 0 (rows)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [96]:
pd.concat([df1, df2, df3], axis = 1) # Make sure you know what you want to concat.

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

##### More example DataFrames & Merging

In [97]:
left = pd.DataFrame({'key' : ['K0', 'K1', 'K2', 'K3'],
                     'A' : ['A0', 'A1', 'A2', 'A3'],
                     'B' : ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key' : ['K0', 'K1', 'K2', 'K3'],
                     'C' : ['C0', 'C1', 'C2', 'C3'],
                     'D' : ['D0', 'D1', 'D2', 'D3']})

In [98]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [99]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [100]:
pd.merge(left, right, how = 'inner', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

As in SQL, we can merge on multiple keys. This is done by passing lists of keys, e.g.:
- `on = ['key1', 'key2']`

Also, we can use outer and right joins:
- `how = right`
- `how = outer`

##### Joining

In [122]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [123]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [124]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

##### Difference between `df.join()` and `df.merge()`

`pandas.merge()` is an underlying function used for all merge/join behavior.

DataFrames provide the `pandas.DataFrame.merge()` and `pandas.DataFrame.join()` methods as a convenient way to access the capabilities of `pandas.merge()`. 

For example, `df1.merge(right=df2, ...)` is equivalent to `pandas.merge(left=df1, right=df2, ...)`.

These are the main differences between `df.join()` and `df.merge()`:

1. **lookup on right table:** `df1.join(df2)` always joins via the index of `df2`, but `df1.merge(df2)` can join to one or more columns of `df2` (default) or to the index of `df2` (with `right_index=True`).

2. **lookup on left table:** by default, `df1.join(df2)` uses the **index** of `df1` and `df1.merge(df2)` uses **column(s)** of `df1`. That can be overridden by specifying `df1.join(df2, on=key_or_keys)` or `df1.merge(df2, right_index=True)`.

3. **left vs inner join:** `df1.join(df2)` does a **left join** by default (keeps all rows of `df1`), but `df.merge` does an **inner join** by default (returns only matching rows of df1 and df2).

So, the generic approach is to use `pandas.merge(df1, df2)` or `df1.merge(df2)`. 

`pd.merge()` is the more flexible method.

But for a number of common situations (keeping all rows of `df1` [aka **'left join'**] and joining to an **index** in `df2`), you can save some typing by using `df1.join(df2)` instead.

- Some notes on these issues from the documentation at Pandas Official Documentation: 

https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

- Also useful:

https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf

_____
#### S6V33 Various additional operations

In [101]:
df = pd.DataFrame(data= {'col1' : [1, 2, 3, 4],
                         'col2' : [444, 555, 666, 444],
                         'col3' : ['abc', 'def', 'ghi', 'xyz']})

df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [102]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [103]:
len(df['col2'].unique())

3

In [104]:
df['col2'].nunique()

3

In [105]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [106]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [107]:
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

##### Applying functions on DataFrames

In [108]:
def times2(x):
    return x*2

In [109]:
df['col1'].sum()

10

In [110]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [111]:
df['col1'] * 2

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [112]:
len(df['col3'])

4

In [113]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [114]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

##### Removing columns

In [115]:
df.drop('col1', axis = 1) # `inplace = False`, by default

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [116]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [117]:
df.columns[0]

'col1'

In [118]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [119]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

##### Sorting

In [120]:
df.sort_values(by = 'col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [121]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

##### Pivot table

In [125]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [126]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [127]:
df.pivot_table(values = 'D', index = ['A', 'B'], columns = 'C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

_____
#### S6V34 Data Input and Output

- `df = pd.read_csv('example')`
- `df.to_csv('example',index=False)`

- `pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')`
- `df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')`

- html...
- SQL...